burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Include/gd32e502_fmc.h
/*!
    \file    gd32e502_fmc.h
    \brief   definitions for the FMC

     \version 2025-02-10, V1.5.0, firmware for GD32E502
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32E502_FMC_H
#define GD32E502_FMC_H

#include "gd32e502.h"

/* FMC and option bytes definition */
#define FMC                          FMC_BASE                                           /*!< FMC register base address */
#define OB                           OB_BASE                                            /*!< option bytes 0 base address */

/* registers definitions */
#define FMC_WS                       REG32((FMC) + 0x00000000U)                         /*!< FMC wait state register */
#define FMC_ECCCS                    REG32((FMC) + 0x00000004U)                         /*!< FMC ECC control and status register */
#define FMC_KEY0                     REG32((FMC) + 0x00000008U)                         /*!< FMC unlock key register 0 */
#define FMC_STAT0                    REG32((FMC) + 0x0000000CU)                         /*!< FMC status register 0 */
#define FMC_CTL0                     REG32((FMC) + 0x00000010U)                         /*!< FMC control register 0 */
#define FMC_ADDR0                    REG32((FMC) + 0x00000014U)                         /*!< FMC address register 0 */
#define FMC_OBKEY                    REG32((FMC) + 0x00000044U)                         /*!< FMC option byte unlock key register */
#define FMC_KEY1                     REG32((FMC) + 0x00000048U)                         /*!< FMC unlock key register 1 */
#define FMC_STAT1                    REG32((FMC) + 0x0000004CU)                         /*!< FMC status register 1 */
#define FMC_CTL1                     REG32((FMC) + 0x00000050U)                         /*!< FMC control register 1 */
#define FMC_ADDR1                    REG32((FMC) + 0x00000054U)                         /*!< FMC address register 1 */
#define FMC_OBSTAT                   REG32((FMC) + 0x0000005CU)                         /*!< FMC option byte status register */
#define FMC_WP0                      REG32((FMC) + 0x00000060U)                         /*!< FMC erase/program protection register 0 */
#define FMC_WP1                      REG32((FMC) + 0x00000064U)                         /*!< FMC erase/program protection register 1 */
#define FMC_OB1CS                    REG32((FMC) + 0x00000068U)                         /*!< FMC option byte 1 control and status register */
#define FMC_PID                      REG32((FMC) + 0x00000100U)                         /*!< FMC product ID register */

#define OP_BYTE(x)                   REG32(OB + ((uint32_t)((uint32_t)0x04U * (x))))    /*!< option bytes 0 value */
#define OB_SPC                       REG16((OB) + 0x00000000U)                          /*!< option bytes 0 security protection value*/
#define OB_USER                      REG16((OB) + 0x00000002U)                          /*!< option bytes 0 user value*/
#define OB_SPC_USER                  REG32((OB) + 0x00000000U)                          /*!< option bytes 0 security protection value and user value */
#define OB_DATA                      REG32((OB) + 0x00000004U)                          /*!< option bytes 0 data value */

/* bits definitions */
/* FMC_WS */
#define FMC_WS_WSCNT                 BITS(0,2)                                          /*!< wait state counter */
#define FMC_WS_PFEN                  BIT(4)                                             /*!< pre-fetch enable */
#define FMC_WS_IDCEN                 BIT(9)                                             /*!< cache enable */
#define FMC_WS_IDRST                 BIT(11)                                            /*!< cache reset */
#define FMC_WS_SLEEP_SLP             BIT(14)                                            /*!< flash goto sleep mode or power-down mode when MCU enters deepsleep mode */
#define FMC_WS_BRAMRDY               BIT(17)                                            /*!< basic SRAM ready flag */
#define FMC_WS_PRAMRDY               BIT(18)                                            /*!< fast PG SRAM ready flag */

/* FMC_ECCCS */
#define FMC_ECCCS_ECCADDR            BITS(0,14)                                         /*!< the offset address of double word where an ECC error is detected */
#define FMC_ECCCS_OB0_ECC            BIT(19)                                            /*!< option bytes 0 one bit error flag */
#define FMC_ECCCS_BK1_ECC            BIT(20)                                            /*!< bank1 one bit error flag */
#define FMC_ECCCS_SYS_ECC            BIT(21)                                            /*!< system memory one bit error flag */
#define FMC_ECCCS_DF_ECC             BIT(22)                                            /*!< data flash one bit error flag */
#define FMC_ECCCS_OTP_ECC            BIT(23)                                            /*!< OTP one bit error flag */
#define FMC_ECCCS_ECCCORIE           BIT(24)                                            /*!< one bit error correct interrupt enable */
#define FMC_ECCCS_ECCDETIE           BIT(25)                                            /*!< two bits error detect interrupt enable */
#define FMC_ECCCS_OB1ECCDET          BIT(26)                                            /*!< option bytes 1 two bits error detect flag */
#define FMC_ECCCS_OB0ECCDET          BIT(27)                                            /*!< option bytes 0 two bits error detect flag */
#define FMC_ECCCS_ECCCOR             BIT(30)                                            /*!< one bit error detected and correct flag */
#define FMC_ECCCS_ECCDET             BIT(31)                                            /*!< two bits error detect flag */

